cases/spinningCat/template/system/blockMeshDict
FoamFile { format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices
(
 (-2 -2 -0.005)
 ( 2 -2 -0.005)
 ( 2  2 -0.005)
 (-2  2 -0.005)
 (-2 -2  1.6)
 ( 2 -2  1.6)
 ( 2  2  1.6)
 (-2  2  1.6)
);
blocks
(
 hex (0 1 2 3 4 5 6 7) (20 20 8) simpleGrading (1 1 1)
);
edges ();
boundary
(
 floor { type wall; faces ((0 3 2 1)); }
 top { type patch; faces ((4 5 6 7)); }
 farSide { type patch; faces ((0 1 5 4)(1 2 6 5)(2 3 7 6)(3 0 4 7)); }
);
mergePatchPairs ();
