cases/spinningCat/template/system/createPatchDict
FoamFile { format ascii; class dictionary; object createPatchDict; }
pointSync false;
patches
(
 {
  name rotorAMI;
  patchInfo { type cyclicAMI; matchTolerance 0.0001; neighbourPatch statorAMI; transform noOrdering; }
  constructFrom patches;
  patches (AMI);
 }
 {
  name statorAMI;
  patchInfo { type cyclicAMI; matchTolerance 0.0001; neighbourPatch rotorAMI; transform noOrdering; }
  constructFrom patches;
  patches (AMI_slave);
 }
);
