cases/spinningCat/template/system/snappyHexMeshDict
FoamFile { format ascii; class dictionary; object snappyHexMeshDict; }
castellatedMesh true;
snap true;
addLayers false;
geometry
{
 cat_spin.stl { type triSurfaceMesh; name cat; }
 AMI.stl { type triSurfaceMesh; name AMI; }
 rotorRefine { type searchableCylinder; point1 (0 0 -0.1); point2 (0 0 0.45); radius 0.38; }
 nearRefine { type searchableCylinder; point1 (0 0 -0.005); point2 (0 0 0.7); radius 0.7; }
 midRefine { type searchableCylinder; point1 (0 0 -0.005); point2 (0 0 1.0); radius 1.2; }
 footGap { type searchableBox; min (-0.36 -0.36 -0.005); max (0.36 0.36 0.03); }
}
castellatedMeshControls
{
 maxLocalCells 500000;
 maxGlobalCells 1000000;
 minRefinementCells 0;
 maxLoadUnbalance 0.10;
 nCellsBetweenLevels 3;
 features
 (
  { file "cat_spin.eMesh"; level 5; }
 );
 refinementSurfaces
 {
  cat { level (4 5); patchInfo { type wall; } }
  AMI
  {
   level (4 4);
   faceType boundary;
   cellZone rotorZone;
   faceZone rotorZone;
   cellZoneInside inside;
  }
 }
 resolveFeatureAngle 35;
 refinementRegions
 {
  rotorRefine { mode inside; levels ((1e15 4)); }
  nearRefine { mode inside; levels ((1e15 3)); }
  midRefine { mode inside; levels ((1e15 2)); }
  footGap { mode inside; levels ((1e15 5)); }
 }
 locationInMesh (1.7 1.7 1.3);
 allowFreeStandingZoneFaces true;
}
snapControls
{
 nSmoothPatch 5;
 tolerance 2.0;
 nSolveIter 100;
 nRelaxIter 8;
 nFeatureSnapIter 15;
 implicitFeatureSnap false;
 explicitFeatureSnap true;
 multiRegionFeatureSnap false;
}
addLayersControls
{
 relativeSizes true;
 layers {};
 expansionRatio 1.2;
 finalLayerThickness 0.3;
 minThickness 0.1;
 nGrow 0;
 featureAngle 60;
 slipFeatureAngle 30;
 nRelaxIter 5;
 nSmoothSurfaceNormals 1;
 nSmoothNormals 3;
 nSmoothThickness 10;
 maxFaceThicknessRatio 0.5;
 maxThicknessToMedialRatio 0.3;
 minMedialAxisAngle 90;
 nBufferCellsNoExtrude 0;
 nLayerIter 50;
}
meshQualityControls
{
 maxNonOrtho 70;
 maxBoundarySkewness 20;
 maxInternalSkewness 4;
 maxConcave 80;
 minVol 1e-15;
 minTetQuality -1e30;
 minArea -1;
 minTwist 0.01;
 minDeterminant 0.001;
 minFaceWeight 0.05;
 minVolRatio 0.01;
 minTriangleTwist -1;
 nSmoothScale 4;
 errorReduction 0.75;
 relaxed { maxNonOrtho 75; }
}
mergeTolerance 1e-6;
