cases/spinningCat/template/constant/turbulenceProperties
FoamFile { format ascii; class dictionary; object turbulenceProperties; }
simulationType RAS;
RAS
{
 model kOmegaSSTSAS;
 turbulence on;
 printCoeffs on;
 kOmegaSSTSASCoeffs
 {
  delta cubeRootVol;
  cubeRootVolCoeffs { deltaCoeff 1; }
 }
}
