cases/spinningCat/template/constant/dynamicMeshDict
FoamFile { format ascii; class dictionary; object dynamicMeshDict; }
dynamicFvMesh dynamicMotionSolverFvMesh;
motionSolverLibs (fvMotionSolvers);
motionSolver solidBody;
cellZone rotorZone;
solidBodyMotionFunction rotatingMotion;
origin (0 0 0);
axis (0 0 1);
omega 24.5;
