cases/spinningCat/template/constant/physicalProperties
FoamFile { format ascii; class dictionary; object physicalProperties; }
viscosityModel constant;
nu 1.50e-5;
