cases/spinningCat/template/constant/transportProperties
FoamFile { format ascii; class dictionary; object transportProperties; }
transportModel Newtonian;
nu [0 2 -1 0 0 0 0] 1.50e-5;
