cases/spinningCat/template/0.orig/p
FoamFile { format ascii; class volScalarField; object p; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
 floor { type zeroGradient; }
 top { type fixedValue; value uniform 0; }
 farSide { type fixedValue; value uniform 0; }
 cat { type zeroGradient; }
 rotorAMI { type cyclicAMI; value uniform 0; }
 statorAMI { type cyclicAMI; value uniform 0; }
}
