cases/spinningCat/template/system/clipPlanes
clipPlanes
{
 type surfaces;
 libs (sampling);
 enabled true;
 writeControl adjustableRunTime;
 writeInterval 0.0208333333333333;
 surfaceFormat vtk;
 formatOptions
 {
  vtk { legacy false; binary true; precision 6; }
 }
 fields (U);
 interpolationScheme cellPoint;
 surfaces
 {
  side
  {
   type plane;
   planeType pointAndNormal;
   pointAndNormalDict { point (0 0 0); normal (1 0 0); }
   interpolate true;
  }
  top
  {
   type plane;
   planeType pointAndNormal;
   pointAndNormalDict { point (0 0 0.20); normal (0 0 1); }
   interpolate true;
  }
 }
}
