cases/spinningCat/template/system/surfaceFeatureExtractDict
FoamFile { format ascii; class dictionary; object surfaceFeatureExtractDict; }
cat_spin.stl
{
 extractionMethod extractFromSurface;
 extractFromSurfaceCoeffs { includedAngle 150; }
 writeObj yes;
}
